// Контрольная задача по завершению модуля Node.js:
// Нужно реализовать локальный сервер на express.js.
// Данный сервер должен выполнять CRUD операции ( Create, Read, Update, Delete).
// А именно сделать серверную часть для TODO Листа (список задач).
// Должна быть возможность создать новую задачу (должно быть описание задачи, заголовок, и по дефолту при добавлении ставите Boolean переменную false на свойство isFinished).
// Должна быть возможность получать список всех задач. Должна быть возможность переключать какую то задачу на isFinished: true, то есть задача завершена.
// И последнее, возможность удаления задачи.
// Методы для запросов используем GET, POST, PUT, DELETE. В качестве хранилища для задач можете использовать просто пустой массив (как мы ранее делали).
// Также нужно делать валидацию (по логике ставите где нужно).

import express from 'express';
import todoRouter from './routes/todo.routes.js'

const app = express();
const PORT = 5000;

app.use(express.json({ extended: true }));
app.use('/todo', todoRouter);


app.listen(PORT, () => {
    console.log(`Server is running on PORT: ${PORT}`)
})
